# Seção 3: Funções mais utilizadas

In [ ]:
import pyodbc
import pandas as pd

In [ ]:
# Some other example server values are
# server = 'localhost\sqlexpress' # for a named instance
# server = 'myserver,port' # to specify an alternate port
server = 'localhost,1433'
database = 'AdventureWorks2017'
username = 'yyyyyyy' # Usuário 
password = '{xxxxxxx}' #Password 
driver = "{ODBC Driver 17 for SQL Server}"

conn_string = f"""
            DRIVER={driver};
            SERVER={server};
            DATABASE={database};
            UID={username};
            PWD={password}
            """
conn = pyodbc.connect(conn_string)

## Datepart

 Retorna um número inteiro que faz parte de uma data, como um dia, mês e ano.

 Sintaxe

 DATEPART(datepart, datecolumnname)

In [ ]:
query = """
        SELECT SalesOrderID, DATEPART(year,OrderDate) as Ano
        FROM Sales.SalesOrderHeader
        """
pd.read_sql(query, conn)

       SalesOrderID   Ano
0             43659  2011
1             43660  2011
2             43661  2011
3             43662  2011
4             43663  2011
...             ...   ...
31460         75119  2014
31461         75120  2014
31462         75121  2014
31463         75122  2014
31464         75123  2014

[31465 rows x 2 columns]

In [ ]:
query = """
        SELECT AVG(TotalDue) as Media, DATEPART(year,OrderDate) as Ano
        FROM Sales.SalesOrderHeader
        GROUP BY DATEPART(year,OrderDate)
        ORDER BY Ano
        """
pd.read_sql(query, conn)

       Media   Ano
0  8808.7738  2011
1  9623.4228  2012
2  3452.6786  2013
3  1906.2578  2014

## Manipulação de String

### CONCAT



A função SQL CONCAT é usada para concatenar duas strings para formar uma única string.

Sintaxe

CONCAT(string1, string2, ...., string_n)

In [ ]:
query = """
        SELECT CONCAT(FirstName,' ',LastName)
        FROM Person.Person
        """
pd.read_sql(query, conn)

0            Syed Abbas
1        Catherine Abel
2       Kim Abercrombie
3       Kim Abercrombie
4       Kim Abercrombie
...                 ...
19967   Patricia Zubaty
19968     Judy Zugelder
19969     Jake Zukowski
19970  Michael Zwilling
19971  Michael Zwilling

[19972 rows x 1 columns]

### UPPER, LOWER E LEN



**UPPER**

Retorna a string str com todos os caracteres alterados para maiúsculas de acordo com o mapeamento do conjunto de caracteres atual.

Sintaxe

UPPER(text)


**LOWER**

Retorna a string str com todos os caracteres alterados para minúsculas de acordo com o mapeamento do conjunto de caracteres atual.

Sintaxe

LOWER(text)


**LEN**

Retorne o comprimento de uma string.

Sintaxe

LEN(string)

In [ ]:
query = """
        SELECT UPPER(FirstName), LOWER(FirstName), LEN(FirstName)
        FROM Person.Person
        """
pd.read_sql(query, conn)

0           SYED       syed  4
1      CATHERINE  catherine  9
2            KIM        kim  3
3            KIM        kim  3
4            KIM        kim  3
...          ...        ... ..
19967   PATRICIA   patricia  8
19968       JUDY       judy  4
19969       JAKE       jake  4
19970    MICHAEL    michael  7
19971    MICHAEL    michael  7

[19972 rows x 3 columns]

### SUBSTRING



Extrai alguns caracteres de uma string.

Sintaxe

SUBSTRING(string, start, length)

In [ ]:
query = """
        SELECT FirstName, SUBSTRING(FirstName,1,2)
        FROM Person.Person
        """
pd.read_sql(query, conn)

       FirstName
0           Syed  Sy
1      Catherine  Ca
2            Kim  Ki
3            Kim  Ki
4            Kim  Ki
...          ...  ..
19967   Patricia  Pa
19968       Judy  Ju
19969       Jake  Ja
19970    Michael  Mi
19971    Michael  Mi

[19972 rows x 2 columns]



Substitui todas as ocorrências de uma substring dentro de uma string por uma nova substring.

Sintaxe

REPLACE(string, old_string, new_string)

### REPLACE

In [ ]:
query = """
        SELECT ProductNumber, REPLACE(ProductNumber,'-','#')
        FROM Production.Product
        """
pd.read_sql(query, conn)

    ProductNumber
0         AR-5381    AR#5381
1         BA-8327    BA#8327
2         BB-7421    BB#7421
3         BB-8107    BB#8107
4         BB-9108    BB#9108
..            ...        ...
499       TT-T092    TT#T092
500     VE-C304-L  VE#C304#L
501     VE-C304-M  VE#C304#M
502     VE-C304-S  VE#C304#S
503       WB-H098    WB#H098

[504 rows x 2 columns]

## Operações Matemáticas

### Adicao e Subtração

In [ ]:
query = """
        SELECT UnitPrice + LineTotal Adicao, UnitPrice - LineTotal Subtracao
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

          Adicao  Subtracao
0       4049.988      0.000
1       8099.976  -4049.988
2       4049.988      0.000
3       4079.988      0.000
4       4079.988      0.000
...          ...        ...
121312    43.960      0.000
121313    17.980      0.000
121314    43.960      0.000
121315   318.000      0.000
121316    17.980      0.000

[121317 rows x 2 columns]

### Multiplicacao e Divisao

In [ ]:
query = """
        SELECT UnitPrice * LineTotal Multiplicacao, UnitPrice / LineTotal Divisao
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

        Multiplicacao   Divisao
0        4.100601e+06  1.000000
1        1.230180e+07  0.333333
2        4.100601e+06  1.000000
3        4.161576e+06  1.000000
4        4.161576e+06  1.000000
...               ...       ...
121312   4.831204e+02  1.000000
121313   8.082010e+01  1.000000
121314   4.831204e+02  1.000000
121315   2.528100e+04  1.000000
121316   8.082010e+01  1.000000

[121317 rows x 2 columns]

### AVG SUM MIN MAX

In [ ]:
query = """
        SELECT AVG(LineTotal) Media, SUM(LineTotal) Soma, MIN(LineTotal) Minimo, MAX(LineTotal) Maximo
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

        Media          Soma  Minimo     Maximo
0  905.449206  1.098464e+08   1.374  27893.619

### ROUND

Arredonda um número para um número especificado de casas decimais.

Sintaxe

ROUND(number, decimals, operation)

In [ ]:
query = """
        SELECT LineTotal, ROUND(LineTotal,2)
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

        LineTotal
0        2024.994  2024.99
1        6074.982  6074.98
2        2024.994  2024.99
3        2039.994  2039.99
4        2039.994  2039.99
...           ...      ...
121312     21.980    21.98
121313      8.990     8.99
121314     21.980    21.98
121315    159.000   159.00
121316      8.990     8.99

[121317 rows x 2 columns]

### SQRT

Retorna a raiz quadrada de um número

Sintaxe

ROUND(number, decimals, operation)

In [ ]:
query = """
        SELECT SQRT(LineTotal)
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

0       44.999933
1       77.942171
2       44.999933
3       45.166293
4       45.166293
...           ...
121312   4.688283
121313   2.998333
121314   4.688283
121315  12.609520
121316   2.998333

[121317 rows x 1 columns]